Revit 2027 API
IFCGuidKey Methods
The IFCGuidKey type exposes the following members.
Methods
Name | Description
Dispose
Equals |  Determines whether this IFCGuidKey is equal to another.
(Overrides Object.Equals(Object))
GetHashCode |  Returns the hash code for this IFCGuidKey
(Overrides Object.GetHashCode())
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
IFCGuidKey Class
Autodesk.Revit.DB.IFC Namespace